{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "# :play intro-neo4j-exercises\n",
    "# Exercise 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Imports\n",
    "from neo4j import GraphDatabase\n",
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Connection to Graph Database\n",
    "user = 'neo4j'\n",
    "pw = 'abc123'\n",
    "uri = 'bolt://localhost:7687'\n",
    "neo4j_driver = GraphDatabase.driver(uri, auth=(user, pw), encrypted = False)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "# # Same Database as Exercise 1\n",
    "# with open('./Exercise1Database.cypher', 'r') as f_read: \n",
    "#   create_db_cypher = f_read.read()\n",
    "\n",
    "# with neo4j_driver.session() as session:\n",
    "#     for cypher in create_db_cypher.split(';'): # statements are split by ';'\n",
    "#         session.run(cypher)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Exercise 2.1: Retrieve all movies that were released in a specific year (Instructions)\n",
    "\n",
    "Retrieve all Movie nodes that have a released property value of 2003."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Node id=9 labels={'Movie'} properties={'title': 'The Matrix Reloaded', 'tagline': 'Free your mind', 'released': 2003}>\n",
      "<Node id=10 labels={'Movie'} properties={'title': 'The Matrix Revolutions', 'tagline': 'Everything that has a beginning has an end', 'released': 2003}>\n",
      "<Node id=154 labels={'Movie'} properties={'title': \"Something's Gotta Give\", 'released': 2003}>\n"
     ]
    }
   ],
   "source": [
    "cypher = 'MATCH (m:Movie {released: 2003}) RETURN m'\n",
    "with neo4j_driver.session() as session:\n",
    "    result = session.run(cypher)\n",
    "    for r in result.value():\n",
    "        print(r)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Exercise 2.2: View the retrieved results as a table (Instructions)\n",
    "View the results you just viewed in Neo4j Browser as a table."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>title</th>\n",
       "      <th>tagline</th>\n",
       "      <th>released</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>id</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>The Matrix Reloaded</td>\n",
       "      <td>Free your mind</td>\n",
       "      <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>The Matrix Revolutions</td>\n",
       "      <td>Everything that has a beginning has an end</td>\n",
       "      <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>154</th>\n",
       "      <td>Something's Gotta Give</td>\n",
       "      <td>None</td>\n",
       "      <td>2003</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                      title                                     tagline  \\\n",
       "id                                                                        \n",
       "9       The Matrix Reloaded                              Free your mind   \n",
       "10   The Matrix Revolutions  Everything that has a beginning has an end   \n",
       "154  Something's Gotta Give                                        None   \n",
       "\n",
       "    released  \n",
       "id            \n",
       "9       2003  \n",
       "10      2003  \n",
       "154     2003  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# in neo4j browser, you just click the table icon after running the cypher. Here, let's make a df\n",
    "movies2003 = pd.DataFrame(columns=['id', 'title', 'tagline', 'released'])\n",
    "cypher = 'MATCH (m:Movie {released: 2003}) RETURN m'\n",
    "with neo4j_driver.session() as session:\n",
    "    result = session.run(cypher)\n",
    "    for r in result.value():\n",
    "        new_row = {'id':r.id, 'title': r['title'], 'tagline': r['tagline'], 'released': r['released']}\n",
    "        movies2003 = movies2003.append(new_row, ignore_index=True)\n",
    "    movies2003 = movies2003.set_index('id')\n",
    "movies2003"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Exercise 2.2: View the retrieved results as a table (Taking it further- optional)\n",
    "\n",
    "Retrieve all movie nodes in the database and view the data as a table. Notice the values for the released property for each node.\n",
    "\n",
    "Try querying the graph using different years."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>title</th>\n",
       "      <th>tagline</th>\n",
       "      <th>released</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>id</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>The Matrix</td>\n",
       "      <td>Welcome to the Real World</td>\n",
       "      <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>The Matrix Reloaded</td>\n",
       "      <td>Free your mind</td>\n",
       "      <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>The Matrix Revolutions</td>\n",
       "      <td>Everything that has a beginning has an end</td>\n",
       "      <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>The Devil's Advocate</td>\n",
       "      <td>Evil has its winning ways</td>\n",
       "      <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>A Few Good Men</td>\n",
       "      <td>In the heart of the nation's capital, in a cou...</td>\n",
       "      <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Top Gun</td>\n",
       "      <td>I feel the need, the need for speed.</td>\n",
       "      <td>1986</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>Jerry Maguire</td>\n",
       "      <td>The rest of his life begins now.</td>\n",
       "      <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>Stand By Me</td>\n",
       "      <td>For some, it's the last real taste of innocenc...</td>\n",
       "      <td>1986</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>As Good as It Gets</td>\n",
       "      <td>A comedy from the heart that goes for the throat.</td>\n",
       "      <td>1997</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>What Dreams May Come</td>\n",
       "      <td>After life there is more. The end is just the ...</td>\n",
       "      <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>Snow Falling on Cedars</td>\n",
       "      <td>First loves last. Forever.</td>\n",
       "      <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>67</th>\n",
       "      <td>You've Got Mail</td>\n",
       "      <td>At odds in life... in love on-line.</td>\n",
       "      <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>Sleepless in Seattle</td>\n",
       "      <td>What if someone you never met, someone you nev...</td>\n",
       "      <td>1993</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>Joe Versus the Volcano</td>\n",
       "      <td>A story of love, lava and burning desire.</td>\n",
       "      <td>1990</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>When Harry Met Sally</td>\n",
       "      <td>At odds in life... in love on-line.</td>\n",
       "      <td>1998</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>That Thing You Do</td>\n",
       "      <td>In every life there comes a time when that thi...</td>\n",
       "      <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>87</th>\n",
       "      <td>The Replacements</td>\n",
       "      <td>Pain heals, Chicks dig scars... Glory lasts fo...</td>\n",
       "      <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>RescueDawn</td>\n",
       "      <td>Based on the extraordinary true story of one m...</td>\n",
       "      <td>2006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>The Birdcage</td>\n",
       "      <td>Come as you are</td>\n",
       "      <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>Unforgiven</td>\n",
       "      <td>It's a hell of a thing, killing a man</td>\n",
       "      <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>100</th>\n",
       "      <td>Johnny Mnemonic</td>\n",
       "      <td>The hottest data on earth. In the coolest head...</td>\n",
       "      <td>1995</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>105</th>\n",
       "      <td>Cloud Atlas</td>\n",
       "      <td>Everything is connected</td>\n",
       "      <td>2012</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>111</th>\n",
       "      <td>The Da Vinci Code</td>\n",
       "      <td>Break The Codes</td>\n",
       "      <td>2006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>116</th>\n",
       "      <td>V for Vendetta</td>\n",
       "      <td>Freedom! Forever!</td>\n",
       "      <td>2006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>Speed Racer</td>\n",
       "      <td>Speed has no limits</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>128</th>\n",
       "      <td>Ninja Assassin</td>\n",
       "      <td>Prepare to enter a secret world of assassins</td>\n",
       "      <td>2009</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>130</th>\n",
       "      <td>The Green Mile</td>\n",
       "      <td>Walk a mile you'll never forget.</td>\n",
       "      <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>137</th>\n",
       "      <td>Frost/Nixon</td>\n",
       "      <td>400 million people were waiting for the truth.</td>\n",
       "      <td>2008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>141</th>\n",
       "      <td>Hoffa</td>\n",
       "      <td>He didn't want law. He wanted justice.</td>\n",
       "      <td>1992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>144</th>\n",
       "      <td>Apollo 13</td>\n",
       "      <td>Houston, we have a problem.</td>\n",
       "      <td>1995</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>147</th>\n",
       "      <td>Twister</td>\n",
       "      <td>Don't Breathe. Don't Look Back.</td>\n",
       "      <td>1996</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>150</th>\n",
       "      <td>Cast Away</td>\n",
       "      <td>At the edge of the world, his journey begins.</td>\n",
       "      <td>2000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>152</th>\n",
       "      <td>One Flew Over the Cuckoo's Nest</td>\n",
       "      <td>If he's crazy, what does that make you?</td>\n",
       "      <td>1975</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>154</th>\n",
       "      <td>Something's Gotta Give</td>\n",
       "      <td>None</td>\n",
       "      <td>2003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>157</th>\n",
       "      <td>Bicentennial Man</td>\n",
       "      <td>One robot's 200 year journey to become an ordi...</td>\n",
       "      <td>1999</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>159</th>\n",
       "      <td>Charlie Wilson's War</td>\n",
       "      <td>A stiff drink. A little mascara. A lot of nerv...</td>\n",
       "      <td>2007</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>161</th>\n",
       "      <td>The Polar Express</td>\n",
       "      <td>This Holiday Season… Believe</td>\n",
       "      <td>2004</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>162</th>\n",
       "      <td>A League of Their Own</td>\n",
       "      <td>Once in a lifetime you get a chance to do some...</td>\n",
       "      <td>1992</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                               title  \\\n",
       "id                                     \n",
       "0                         The Matrix   \n",
       "9                The Matrix Reloaded   \n",
       "10            The Matrix Revolutions   \n",
       "11              The Devil's Advocate   \n",
       "15                    A Few Good Men   \n",
       "29                           Top Gun   \n",
       "37                     Jerry Maguire   \n",
       "46                       Stand By Me   \n",
       "52                As Good as It Gets   \n",
       "56              What Dreams May Come   \n",
       "62            Snow Falling on Cedars   \n",
       "67                   You've Got Mail   \n",
       "73              Sleepless in Seattle   \n",
       "78            Joe Versus the Volcano   \n",
       "81              When Harry Met Sally   \n",
       "85                 That Thing You Do   \n",
       "87                  The Replacements   \n",
       "92                        RescueDawn   \n",
       "95                      The Birdcage   \n",
       "97                        Unforgiven   \n",
       "100                  Johnny Mnemonic   \n",
       "105                      Cloud Atlas   \n",
       "111                The Da Vinci Code   \n",
       "116                   V for Vendetta   \n",
       "121                      Speed Racer   \n",
       "128                   Ninja Assassin   \n",
       "130                   The Green Mile   \n",
       "137                      Frost/Nixon   \n",
       "141                            Hoffa   \n",
       "144                        Apollo 13   \n",
       "147                          Twister   \n",
       "150                        Cast Away   \n",
       "152  One Flew Over the Cuckoo's Nest   \n",
       "154           Something's Gotta Give   \n",
       "157                 Bicentennial Man   \n",
       "159             Charlie Wilson's War   \n",
       "161                The Polar Express   \n",
       "162            A League of Their Own   \n",
       "\n",
       "                                               tagline released  \n",
       "id                                                               \n",
       "0                            Welcome to the Real World     1999  \n",
       "9                                       Free your mind     2003  \n",
       "10          Everything that has a beginning has an end     2003  \n",
       "11                           Evil has its winning ways     1997  \n",
       "15   In the heart of the nation's capital, in a cou...     1992  \n",
       "29                I feel the need, the need for speed.     1986  \n",
       "37                    The rest of his life begins now.     2000  \n",
       "46   For some, it's the last real taste of innocenc...     1986  \n",
       "52   A comedy from the heart that goes for the throat.     1997  \n",
       "56   After life there is more. The end is just the ...     1998  \n",
       "62                          First loves last. Forever.     1999  \n",
       "67                 At odds in life... in love on-line.     1998  \n",
       "73   What if someone you never met, someone you nev...     1993  \n",
       "78           A story of love, lava and burning desire.     1990  \n",
       "81                 At odds in life... in love on-line.     1998  \n",
       "85   In every life there comes a time when that thi...     1996  \n",
       "87   Pain heals, Chicks dig scars... Glory lasts fo...     2000  \n",
       "92   Based on the extraordinary true story of one m...     2006  \n",
       "95                                     Come as you are     1996  \n",
       "97               It's a hell of a thing, killing a man     1992  \n",
       "100  The hottest data on earth. In the coolest head...     1995  \n",
       "105                            Everything is connected     2012  \n",
       "111                                    Break The Codes     2006  \n",
       "116                                  Freedom! Forever!     2006  \n",
       "121                                Speed has no limits     2008  \n",
       "128       Prepare to enter a secret world of assassins     2009  \n",
       "130                   Walk a mile you'll never forget.     1999  \n",
       "137     400 million people were waiting for the truth.     2008  \n",
       "141             He didn't want law. He wanted justice.     1992  \n",
       "144                        Houston, we have a problem.     1995  \n",
       "147                    Don't Breathe. Don't Look Back.     1996  \n",
       "150      At the edge of the world, his journey begins.     2000  \n",
       "152            If he's crazy, what does that make you?     1975  \n",
       "154                                               None     2003  \n",
       "157  One robot's 200 year journey to become an ordi...     1999  \n",
       "159  A stiff drink. A little mascara. A lot of nerv...     2007  \n",
       "161                     This Holiday Season… Believe     2004  \n",
       "162  Once in a lifetime you get a chance to do some...     1992  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "movies_all = pd.DataFrame(columns=['id', 'title', 'tagline', 'released'])\n",
    "cypher = 'MATCH (m:Movie) RETURN m'\n",
    "with neo4j_driver.session() as session:\n",
    "    result = session.run(cypher)\n",
    "    for r in result.value():\n",
    "        new_row = {'id':r.id, 'title': r['title'], 'tagline': r['tagline'], 'released': r['released']}\n",
    "        movies_all = movies_all.append(new_row, ignore_index=True)\n",
    "    movies_all = movies_all.set_index('id')\n",
    "movies_all"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Exercise 2.3: Query the database for all property keys (Instructions)\n",
    "\n",
    "You want to know the existing property keys used in a graph. This will help you to write Cypher queries that utilizes property keys for filtering data or for returning data.\n",
    "\n",
    "Query the database for all property keys."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['tagline', 'title', 'released', 'born', 'name', 'roles', 'summary', 'rating']"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "cypher = 'CALL db.propertyKeys()'\n",
    "propertyKeys = []\n",
    "with neo4j_driver.session() as session:\n",
    "    result = session.run(cypher)\n",
    "    for r in result:\n",
    "        propertyKeys.append(r['propertyKey'])\n",
    "propertyKeys"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Exercise 2.4: Retrieve all Movies released in a specific year, returning their titles (Instructions)\n",
    "\n",
    "Rather than returning the nodes that satisfy a query, you want to return data from the nodes.\n",
    "\n",
    "Retrieve all Movies released in 2006, returning their titles."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Use a function to wrap the call:\n",
    "def get_title_for_year(year):\n",
    "    cypher = 'MATCH (m:Movie {released: $year}) RETURN m.title'\n",
    "    titles = []\n",
    "    with neo4j_driver.session() as session:\n",
    "        result = session.run(cypher, year=year)\n",
    "        for r in result:\n",
    "            titles.append(r['m.title'])\n",
    "    return titles"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['RescueDawn', 'The Da Vinci Code', 'V for Vendetta']"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "get_title_for_year(2006)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Exercise 2.4: Retrieve all Movies released in a specific year, returning their titles (Taking it further - optional)\n",
    "\n",
    "Retrieve all Movie nodes and view them as a table. Observe the properties that Movie nodes have.\n",
    "\n",
    "Query the database using a different year and also return more property values."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# Use a function to wrap the call:\n",
    "def get_movies_for_year(year):\n",
    "    cypher = 'MATCH (m:Movie {released: $year}) RETURN m'\n",
    "    movies = []\n",
    "    with neo4j_driver.session() as session:\n",
    "        result = session.run(cypher, year=year)\n",
    "        for r in result:\n",
    "            movies.append(r['m'])\n",
    "    return movies"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node ID# 92 RescueDawn\n",
      "Node ID# 111 The Da Vinci Code\n",
      "Node ID# 116 V for Vendetta\n"
     ]
    }
   ],
   "source": [
    "m_list = get_movies_for_year(2006)\n",
    "for m in m_list:\n",
    "    print(f\"Node ID# {m.id} {m['title']}\") # can display any other properties like this"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "Exercise 2.5: Display title, released, and tagline values for every Movie node in the graph (Instructions)\n",
    "\n",
    "When you start working with a graph, it is sometimes helpful to simply view property values. This can sometimes help to inform you about future queries you may want to execute against the graph.\n",
    "\n",
    "Retrieve all Movie nodes from the database and return the title, released, and tagline values."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'m.title': 'The Matrix', 'm.released': 1999, 'm.tagline': 'Welcome to the Real World'}\n",
      "{'m.title': 'The Matrix Reloaded', 'm.released': 2003, 'm.tagline': 'Free your mind'}\n",
      "{'m.title': 'The Matrix Revolutions', 'm.released': 2003, 'm.tagline': 'Everything that has a beginning has an end'}\n",
      "{'m.title': \"The Devil's Advocate\", 'm.released': 1997, 'm.tagline': 'Evil has its winning ways'}\n",
      "{'m.title': 'A Few Good Men', 'm.released': 1992, 'm.tagline': \"In the heart of the nation's capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.\"}\n",
      "{'m.title': 'Top Gun', 'm.released': 1986, 'm.tagline': 'I feel the need, the need for speed.'}\n",
      "{'m.title': 'Jerry Maguire', 'm.released': 2000, 'm.tagline': 'The rest of his life begins now.'}\n",
      "{'m.title': 'Stand By Me', 'm.released': 1986, 'm.tagline': \"For some, it's the last real taste of innocence, and the first real taste of life. But for everyone, it's the time that memories are made of.\"}\n",
      "{'m.title': 'As Good as It Gets', 'm.released': 1997, 'm.tagline': 'A comedy from the heart that goes for the throat.'}\n",
      "{'m.title': 'What Dreams May Come', 'm.released': 1998, 'm.tagline': 'After life there is more. The end is just the beginning.'}\n",
      "{'m.title': 'Snow Falling on Cedars', 'm.released': 1999, 'm.tagline': 'First loves last. Forever.'}\n",
      "{'m.title': \"You've Got Mail\", 'm.released': 1998, 'm.tagline': 'At odds in life... in love on-line.'}\n",
      "{'m.title': 'Sleepless in Seattle', 'm.released': 1993, 'm.tagline': 'What if someone you never met, someone you never saw, someone you never knew was the only someone for you?'}\n",
      "{'m.title': 'Joe Versus the Volcano', 'm.released': 1990, 'm.tagline': 'A story of love, lava and burning desire.'}\n",
      "{'m.title': 'When Harry Met Sally', 'm.released': 1998, 'm.tagline': 'At odds in life... in love on-line.'}\n",
      "{'m.title': 'That Thing You Do', 'm.released': 1996, 'm.tagline': 'In every life there comes a time when that thing you dream becomes that thing you do'}\n",
      "{'m.title': 'The Replacements', 'm.released': 2000, 'm.tagline': 'Pain heals, Chicks dig scars... Glory lasts forever'}\n",
      "{'m.title': 'RescueDawn', 'm.released': 2006, 'm.tagline': \"Based on the extraordinary true story of one man's fight for freedom\"}\n",
      "{'m.title': 'The Birdcage', 'm.released': 1996, 'm.tagline': 'Come as you are'}\n",
      "{'m.title': 'Unforgiven', 'm.released': 1992, 'm.tagline': \"It's a hell of a thing, killing a man\"}\n",
      "{'m.title': 'Johnny Mnemonic', 'm.released': 1995, 'm.tagline': 'The hottest data on earth. In the coolest head in town'}\n",
      "{'m.title': 'Cloud Atlas', 'm.released': 2012, 'm.tagline': 'Everything is connected'}\n",
      "{'m.title': 'The Da Vinci Code', 'm.released': 2006, 'm.tagline': 'Break The Codes'}\n",
      "{'m.title': 'V for Vendetta', 'm.released': 2006, 'm.tagline': 'Freedom! Forever!'}\n",
      "{'m.title': 'Speed Racer', 'm.released': 2008, 'm.tagline': 'Speed has no limits'}\n",
      "{'m.title': 'Ninja Assassin', 'm.released': 2009, 'm.tagline': 'Prepare to enter a secret world of assassins'}\n",
      "{'m.title': 'The Green Mile', 'm.released': 1999, 'm.tagline': \"Walk a mile you'll never forget.\"}\n",
      "{'m.title': 'Frost/Nixon', 'm.released': 2008, 'm.tagline': '400 million people were waiting for the truth.'}\n",
      "{'m.title': 'Hoffa', 'm.released': 1992, 'm.tagline': \"He didn't want law. He wanted justice.\"}\n",
      "{'m.title': 'Apollo 13', 'm.released': 1995, 'm.tagline': 'Houston, we have a problem.'}\n",
      "{'m.title': 'Twister', 'm.released': 1996, 'm.tagline': \"Don't Breathe. Don't Look Back.\"}\n",
      "{'m.title': 'Cast Away', 'm.released': 2000, 'm.tagline': 'At the edge of the world, his journey begins.'}\n",
      "{'m.title': \"One Flew Over the Cuckoo's Nest\", 'm.released': 1975, 'm.tagline': \"If he's crazy, what does that make you?\"}\n",
      "{'m.title': \"Something's Gotta Give\", 'm.released': 2003, 'm.tagline': None}\n",
      "{'m.title': 'Bicentennial Man', 'm.released': 1999, 'm.tagline': \"One robot's 200 year journey to become an ordinary man.\"}\n",
      "{'m.title': \"Charlie Wilson's War\", 'm.released': 2007, 'm.tagline': \"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\"}\n",
      "{'m.title': 'The Polar Express', 'm.released': 2004, 'm.tagline': 'This Holiday Season… Believe'}\n",
      "{'m.title': 'A League of Their Own', 'm.released': 1992, 'm.tagline': 'Once in a lifetime you get a chance to do something different.'}\n"
     ]
    }
   ],
   "source": [
    "cypher = 'MATCH (m:Movie) RETURN m.title, m.released, m.tagline'\n",
    "with neo4j_driver.session() as session:\n",
    "    result = session.run(cypher)\n",
    "    for r in result: # notice not taking value here :O\n",
    "        print(dict(r)) # can access individual items w/ r['m.title'], or convert record to dict"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Exercise 2.6: Display more user-friendly headers in the table (Instructions)\n",
    "\n",
    "Modify the query you just ran so that the headings for the columns of the table returned are more descriptive."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'movie title': 'The Matrix', 'release': 1999, 'tagline': 'Welcome to the Real World'}\n",
      "{'movie title': 'The Matrix Reloaded', 'release': 2003, 'tagline': 'Free your mind'}\n",
      "{'movie title': 'The Matrix Revolutions', 'release': 2003, 'tagline': 'Everything that has a beginning has an end'}\n",
      "{'movie title': \"The Devil's Advocate\", 'release': 1997, 'tagline': 'Evil has its winning ways'}\n",
      "{'movie title': 'A Few Good Men', 'release': 1992, 'tagline': \"In the heart of the nation's capital, in a courthouse of the U.S. government, one man will stop at nothing to keep his honor, and one will stop at nothing to find the truth.\"}\n",
      "{'movie title': 'Top Gun', 'release': 1986, 'tagline': 'I feel the need, the need for speed.'}\n",
      "{'movie title': 'Jerry Maguire', 'release': 2000, 'tagline': 'The rest of his life begins now.'}\n",
      "{'movie title': 'Stand By Me', 'release': 1986, 'tagline': \"For some, it's the last real taste of innocence, and the first real taste of life. But for everyone, it's the time that memories are made of.\"}\n",
      "{'movie title': 'As Good as It Gets', 'release': 1997, 'tagline': 'A comedy from the heart that goes for the throat.'}\n",
      "{'movie title': 'What Dreams May Come', 'release': 1998, 'tagline': 'After life there is more. The end is just the beginning.'}\n",
      "{'movie title': 'Snow Falling on Cedars', 'release': 1999, 'tagline': 'First loves last. Forever.'}\n",
      "{'movie title': \"You've Got Mail\", 'release': 1998, 'tagline': 'At odds in life... in love on-line.'}\n",
      "{'movie title': 'Sleepless in Seattle', 'release': 1993, 'tagline': 'What if someone you never met, someone you never saw, someone you never knew was the only someone for you?'}\n",
      "{'movie title': 'Joe Versus the Volcano', 'release': 1990, 'tagline': 'A story of love, lava and burning desire.'}\n",
      "{'movie title': 'When Harry Met Sally', 'release': 1998, 'tagline': 'At odds in life... in love on-line.'}\n",
      "{'movie title': 'That Thing You Do', 'release': 1996, 'tagline': 'In every life there comes a time when that thing you dream becomes that thing you do'}\n",
      "{'movie title': 'The Replacements', 'release': 2000, 'tagline': 'Pain heals, Chicks dig scars... Glory lasts forever'}\n",
      "{'movie title': 'RescueDawn', 'release': 2006, 'tagline': \"Based on the extraordinary true story of one man's fight for freedom\"}\n",
      "{'movie title': 'The Birdcage', 'release': 1996, 'tagline': 'Come as you are'}\n",
      "{'movie title': 'Unforgiven', 'release': 1992, 'tagline': \"It's a hell of a thing, killing a man\"}\n",
      "{'movie title': 'Johnny Mnemonic', 'release': 1995, 'tagline': 'The hottest data on earth. In the coolest head in town'}\n",
      "{'movie title': 'Cloud Atlas', 'release': 2012, 'tagline': 'Everything is connected'}\n",
      "{'movie title': 'The Da Vinci Code', 'release': 2006, 'tagline': 'Break The Codes'}\n",
      "{'movie title': 'V for Vendetta', 'release': 2006, 'tagline': 'Freedom! Forever!'}\n",
      "{'movie title': 'Speed Racer', 'release': 2008, 'tagline': 'Speed has no limits'}\n",
      "{'movie title': 'Ninja Assassin', 'release': 2009, 'tagline': 'Prepare to enter a secret world of assassins'}\n",
      "{'movie title': 'The Green Mile', 'release': 1999, 'tagline': \"Walk a mile you'll never forget.\"}\n",
      "{'movie title': 'Frost/Nixon', 'release': 2008, 'tagline': '400 million people were waiting for the truth.'}\n",
      "{'movie title': 'Hoffa', 'release': 1992, 'tagline': \"He didn't want law. He wanted justice.\"}\n",
      "{'movie title': 'Apollo 13', 'release': 1995, 'tagline': 'Houston, we have a problem.'}\n",
      "{'movie title': 'Twister', 'release': 1996, 'tagline': \"Don't Breathe. Don't Look Back.\"}\n",
      "{'movie title': 'Cast Away', 'release': 2000, 'tagline': 'At the edge of the world, his journey begins.'}\n",
      "{'movie title': \"One Flew Over the Cuckoo's Nest\", 'release': 1975, 'tagline': \"If he's crazy, what does that make you?\"}\n",
      "{'movie title': \"Something's Gotta Give\", 'release': 2003, 'tagline': None}\n",
      "{'movie title': 'Bicentennial Man', 'release': 1999, 'tagline': \"One robot's 200 year journey to become an ordinary man.\"}\n",
      "{'movie title': \"Charlie Wilson's War\", 'release': 2007, 'tagline': \"A stiff drink. A little mascara. A lot of nerve. Who said they couldn't bring down the Soviet empire.\"}\n",
      "{'movie title': 'The Polar Express', 'release': 2004, 'tagline': 'This Holiday Season… Believe'}\n",
      "{'movie title': 'A League of Their Own', 'release': 1992, 'tagline': 'Once in a lifetime you get a chance to do something different.'}\n"
     ]
    }
   ],
   "source": [
    "# Changing the previous code so the dictionary key are more friendly:\n",
    "cypher = 'MATCH (m:Movie) RETURN m.title AS `movie title`, m.released AS release, m.tagline AS tagline'\n",
    "with neo4j_driver.session() as session:\n",
    "    result = session.run(cypher)\n",
    "    for r in result: # notice not taking value here :O\n",
    "        print(dict(r)) # can access individual items w/ r['m.title'], or convert record to dict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.7.5 64-bit ('YouTube': pipenv)",
   "language": "python",
   "name": "python37564bityoutubepipenvc59bfe2260c546fcb63499293b62f348"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
